app/views/users/show.html.erb

<p>
	<%= "Has made #{pluralize(@user.ratings.count, 'rating')}" %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]