app/views/ratings/_activeusers.html.erb

SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 3]]
---
        <td><%= user.favorite_brewery %></td>
        <td><%= user.ratings.count %></td>