app/controllers/beers_controller.rb

    def index
        @beers = Beer.includes(:brewery, :style).all
---
SELECT "beers".* FROM "beers"