app/controllers/ratings_controller.rb

SELECT "beers".* FROM "beers"
SELECT "users".* FROM "users"
---
  def index
    @beers = Beer.all
    @best_beers = Beer.top 3
    @best_users = User.top 3
    @best_breweries = Brewery.top 3
    @best_styles = Style.top 3
  	@ratings = Rating.all
    @recent = Rating.recent
    @users = User.all