app/controllers/styles_controller.rb

SELECT "styles".* FROM "styles"
---
  def index
    @styles = Style.all